In [57]:
import pandas as pd
people = {
    'first': ['Adam', 'Ewa', 'Jan'],
    'last': ['Kowalski', 'Nowak', 'Nowak'],
    'email': ['adam.kowalki@mail.com', 'ewa.kowalska@mail.com', 'jan.kowalski@gmail.com']
}
df = pd.DataFrame(people)

In [58]:
df['first'] + ' ' +  df['last']

0    Adam Kowalski
1        Ewa Nowak
2        Jan Nowak
dtype: object

In [59]:
df['full_name'] = df['first'] + ' ' +  df['last']
df

  first      last                   email      full_name
0  Adam  Kowalski   adam.kowalki@mail.com  Adam Kowalski
1   Ewa     Nowak   ewa.kowalska@mail.com      Ewa Nowak
2   Jan     Nowak  jan.kowalski@gmail.com      Jan Nowak

In [60]:
df.drop(columns=['first', 'last'], inplace=True)

In [61]:
df['full_name'].str.split(' ', expand=True)

      0         1
0  Adam  Kowalski
1   Ewa     Nowak
2   Jan     Nowak

In [62]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
df

                    email      full_name first      last
0   adam.kowalki@mail.com  Adam Kowalski  Adam  Kowalski
1   ewa.kowalska@mail.com      Ewa Nowak   Ewa     Nowak
2  jan.kowalski@gmail.com      Jan Nowak   Jan     Nowak

In [63]:
df.append({'first': 'Tom'}, ignore_index=True)

C:\Users\gracj\AppData\Local\Temp\ipykernel_5720\850312662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first': 'Tom'}, ignore_index=True)

                    email      full_name first      last
0   adam.kowalki@mail.com  Adam Kowalski  Adam  Kowalski
1   ewa.kowalska@mail.com      Ewa Nowak   Ewa     Nowak
2  jan.kowalski@gmail.com      Jan Nowak   Jan     Nowak
3                     NaN            NaN   Tom       NaN

In [64]:
people2 = {
    'first': ['Adam', 'Lewus', 'Prawus'],
    'last': ['Kowalski', 'Jan', 'Ewa'],
    'email': ['adam.kowalki@mail.com', 'lewus.kowalska@mail.com', 'prawus.kowalski@gmail.com']
}
df2 = pd.DataFrame(people2)

In [65]:
df.append(df2, ignore_index=True, sort=False)

C:\Users\gracj\AppData\Local\Temp\ipykernel_5720\2503217469.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=False)

                       email      full_name   first      last
0      adam.kowalki@mail.com  Adam Kowalski    Adam  Kowalski
1      ewa.kowalska@mail.com      Ewa Nowak     Ewa     Nowak
2     jan.kowalski@gmail.com      Jan Nowak     Jan     Nowak
3      adam.kowalki@mail.com            NaN    Adam  Kowalski
4    lewus.kowalska@mail.com            NaN   Lewus       Jan
5  prawus.kowalski@gmail.com            NaN  Prawus       Ewa

In [66]:
df = df.append(df2, ignore_index=True, sort=False)

C:\Users\gracj\AppData\Local\Temp\ipykernel_5720\3370980109.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

In [68]:
df

                       email      full_name   first      last
0      adam.kowalki@mail.com  Adam Kowalski    Adam  Kowalski
1      ewa.kowalska@mail.com      Ewa Nowak     Ewa     Nowak
2     jan.kowalski@gmail.com      Jan Nowak     Jan     Nowak
3      adam.kowalki@mail.com            NaN    Adam  Kowalski
4    lewus.kowalska@mail.com            NaN   Lewus       Jan
5  prawus.kowalski@gmail.com            NaN  Prawus       Ewa

In [70]:
df.drop(index=4)

                       email      full_name   first      last
0      adam.kowalki@mail.com  Adam Kowalski    Adam  Kowalski
1      ewa.kowalska@mail.com      Ewa Nowak     Ewa     Nowak
2     jan.kowalski@gmail.com      Jan Nowak     Jan     Nowak
3      adam.kowalki@mail.com            NaN    Adam  Kowalski
5  prawus.kowalski@gmail.com            NaN  Prawus       Ewa

In [72]:
filt = df['last'] == 'Nowak'
df.drop(index=df[filt].index)

                       email      full_name   first      last
0      adam.kowalki@mail.com  Adam Kowalski    Adam  Kowalski
3      adam.kowalki@mail.com            NaN    Adam  Kowalski
4    lewus.kowalska@mail.com            NaN   Lewus       Jan
5  prawus.kowalski@gmail.com            NaN  Prawus       Ewa